# Задача 3.

# Є стрінг з певним текстом (можна скористатися input або константою).
# Напишіть код, який визначить кількість слів в цьому тексті, які закінчуються на "о"
# (враховуються як великі так і маленькі).

print('Enter the text, please:')
str1 = input()
str2 = str1.split()
qnt = 0
for i in str2:
    if i[-1].lower() == 'o':
        qnt += 1
print(qnt)

